<%@ page language="java" contentType="text/html; charset=UTF-8" pageEncoding="UTF-8"%>

<!DOCTYPE html>
<html>
<head>
<meta charset="UTF-8">
<title>Insert title here</title>
</head>
<body>

	<h1>el, jstl</h1>
	<h2>el</h2>
	<h3>연산자</h3>
	
	산술형(+): \${10+2} --> ${10+2} <br>
	산술형(-): \${10-3} --> ${10-3} <br>
	산술형(*): \${10*3} --> ${10*3} <br>
	<br>
	산술형(/): \${10/3} --> ${10/3} <br>
	산술형(/): \${10 div 3} --> ${10 div 3} <br>
	<br>
	산술형(%): \${10%3} --> ${10%3} <br>
	산술형(%): \${10 mod 3} --> ${10 mod 3} <br>
	
	<br><br>
	
	산술형: ${7.5+0.2589} <br>
	산술형: ${7.5-2.259} <br>
	
	<br><br>
	
	관계형: \${5>2} --> ${5>2} <br>
	관계형: \${5 gt 2} --> ${5 gt 2} <br> <!-- n이 크다 n보다(>) -->
	<br>
	관계형: \${5>=2} --> ${5>=2} <br>
	관계형: \${5 ge 2} --> ${5 ge 2} <br> <!-- n이 같거나 크다 n보다(>=) -->
	<br>
	관계형: \${5<2} --> ${5<2} <br>
	관계형: \${5 lt 2} --> ${5 lt 2} <br> <!-- n이 작다 n보다(<) -->
	<br>
	관계형: \${5<=2} --> ${5<=2} <br>
	관계형: \${5 le 2} --> ${5 le 2} <br> <!-- n이 같거나 작다 n보다(<=) -->
	<br>
	관계형: \${5==2} --> ${5==2} <br>
	관계형: \${5 eq 2} --> ${5 eq 2} <br> <!-- n이 n과 같다(==) -->
	<br>
	관계형: \${5!=2} --> ${5!=2} <br>!=
	관계형: \${5 ne 2} --> ${5 ne 2} <br> <!-- n이 n과 같지 않다(!=) -->
	
	<br><br>
	
	조건형: \${5>=2 ? 5 : 2} --> ${5>=2 ? 5 : 2} <br> <!-- 5가 2보다 크면 같으면 5를 작으면 2를 표시 -->
	
	<br><br>
	
	논리형: \${ (5>2) && (10>2) } --> ${ (5>2) && (10>2) } <br> <!-- and -->
	논리형: \${ (5<2) && (10>2) } --> ${ (5<2) && (10>2) } <br> <!-- and -->
	논리형: \${ (5<2) || (10>2) } --> ${ (5<2) || (10>2) } <br> <!-- or -->
	논리형: \${!(5>2)} --> ${!(5>2)} <br> <!-- not -->
	
	<br><br>
	
	null 검사: \${str} --> ${str} <br>
	null 검사: \${empty str} --> ${empty str} <br>
	null 검사: \${reqVal} --> ${reqVal} <br>
	
	<br><br>

</body>
</html>
